const express = require('express');
const fs = require('fs');
const hbs = require('hbs');
const path = require('path');
const { title } = require('process');

const app = express();
const host = '127.0.0.1';
const port = 80;

app.set('view engine', 'hbs');
app.set('views', path.join(__dirname, 'views'));

// Регистрация частичных шаблонов
hbs.registerPartials(path.join(__dirname, 'views/partials'));

// Регистрация хелпера eq
hbs.registerHelper('eq', function (a, b) {
    return a === b;
});

// Статические файлы
app.use(express.static('static'));

// Данные
const acitvityes = {
    title: 'Деятельность разработчиков программного обеспечения',
    list: [
        {
            'service_name': 'Разработка программного обеспечения',
            'img_path': 'img/program_code.jpg',
            'description': 'Создание высококачественного программного обеспечения, от написания кода до тестирования и внедрения.',
            'about_page_link': '#'
        },
        {
            'service_name': 'Веб-разработка',
            'img_path': 'img/site_code.jpg',
            'description': 'Создание адаптивных и функциональных веб-сайтов, оптимизированных для различных устройств.',
            'about_page_link': '#'
        },
        {
            'service_name': 'Системное программирование',
            'img_path': 'img/microsheme.jpg',
            'description': 'Разработка программного обеспечения для работы на различных операционных системах и платформах.',
            'about_page_link': '#'
        },
        {
            'service_name': 'Исследование новых технологий',
            'img_path': 'img/new_technologies.webp',
            'description': 'Погружение в новейшие информационные технологии и инновации, создание решений для развития будущего.',
            'about_page_link': '#'
        },
        {
            'service_name': 'Моделирование и симуляция',
            'img_path': 'img/modelling.jpg',
            'description': 'Использование передовых методов моделирования для создания и анализа сложных систем.',
            'about_page_link': '#'
        },
        {
            'service_name': 'Разработка искусственного интеллекта',
            'img_path': 'img/ai.jpg',
            'description': 'Создание и внедрение алгоритмов машинного обучения и ИИ для решения сложных задач и оптимизации процессов.',
            'about_page_link': '#'
        }
    ]
};

const persons = [
    {
        'name': 'Иван Иванов',
        'about': 'CEO. Специализируется на стратегии и управлении проектами. Опыт более 15 лет в IT-сфере.',
        'img': 'img/seo.png'
    },
    {
        'name': 'Анна Смирнова',
        'about': 'Технический директор. Эксперт в разработке программного обеспечения и архитектуре систем. Более 10 лет опыта.',
        'img': 'img/proger_women.png'
    },
    {
        'name': 'Сергей Петров',
        'about': 'Главный разработчик. Специализируется на веб-технологиях и интеграции систем. Опыт работы более 8 лет.',
        'img': 'img/main_proger.png'
    }
];

const offices = [
    {
        img: 'img/moscow_office.jpg',
        name: 'Офис в Калуге',
        about: 'Наш главный офис находится в центре Калуги, где работают наши ведущие специалисты и управленцы.'
    },
    {
        img: 'img/sbp_office.jpg',
        name: 'Офис в Санкт-Петербурге',
        about: 'Наш офис в Санкт-Петербурге специализируется на разработке и поддержке программного обеспечения для наших клиентов в северной столице.'
    }
];

const about = {
    company: {
        title: 'О нас',
        first_tex_entry: 'Мы – команда профессионалов, объединенных общей целью: предоставление высококачественных IT-услуг для бизнеса и частных клиентов. Наша компания специализируется на разработке программного обеспечения, установке и настройке систем, а также интеграции сторонних сервисов.',
        second_text_entry: 'Мы гордимся тем, что можем предложить уникальные решения, отвечающие самым высоким стандартам качества и безопасности. Наша команда имеет богатый опыт в различных областях IT и использует передовые технологии для достижения наилучших результатов.'
    },
    employers: {
        title: 'Наша команда',
        list: persons
    },
    offices: {
        title: 'Наши офисы',
        list: offices
    }
};

const services = {
    free: {
        title: 'Консультативные услуги в области IT',
        list: [
            {
                img: 'img/cloud_solutions.webp',
                name: 'Облачные решения',
                about: 'Консультации по внедрению и оптимизации облачных сервисов для повышения гибкости и уменьшения затрат'
            },
            {
                img: 'img/cybersecurity.webp',
                name: 'Кибербезопасность',
                about: 'Оценка и укрепление безопасности данных и систем для защиты от киберугроз и атак'
            },
            {
                img: 'img/it_consulting.webp',
                name: 'IT-консалтинг',
                about: 'Анализ и улучшение существующей IT-инфраструктуры для достижения максимальной эффективности и безопасности'
            }
        ]
    },
    paid: {
        title: 'Наши услуги',
        list: [
            {
                category: 'Установка программного обеспечения',
                items: [
                    {
                        title: 'Установка и настройка операционных систем',
                        description: 'Обеспечиваем установку и оптимизацию различных операционных систем, таких как Windows, macOS или Linux, на новые или существующие устройства. Включает в себя настройку системных параметров, установку обновлений и драйверов.'
                    },
                    {
                        title: 'Установка и настройка бизнес-программ',
                        description: 'Помогаем установить и настроить специализированное программное обеспечение для бизнеса, включая CRM-системы, ERP-системы, бухгалтерские программы и офисные пакеты. Обеспечиваем интеграцию с существующими системами и обучение пользователей.'
                    },
                    {
                        title: 'Установка антивирусного ПО и средств безопасности',
                        description: 'Предоставляем услуги по установке и настройке антивирусного программного обеспечения, фаерволов и других средств защиты данных. Проводим конфигурацию для обеспечения максимальной безопасности и защиты от вредоносных программ и угроз.'
                    }
                ]
            },
            {
                category: 'Разработка серверного и десктопного ПО',
                items: [
                    {
                        title: 'Разработка серверных приложений',
                        description: 'Создание и оптимизация серверных решений для обработки больших объемов данных, обеспечения стабильной работы веб-приложений, а также интеграции с базами данных и другими внешними системами. Включает разработку RESTful API, микросервисов и бизнес-логики.'
                    },
                    {
                        title: 'Разработка десктопных приложений',
                        description: 'Проектирование и разработка приложений для настольных операционных систем, таких как Windows, macOS и Linux. Это может включать как простые утилиты, так и сложные корпоративные решения с богатым пользовательским интерфейсом и интеграцией с аппаратным обеспечением.'
                    },
                    {
                        title: 'Миграция и обновление существующих приложений',
                        description: 'Обеспечиваем перенос и обновление старых приложений на новые платформы или технологии. Включает в себя рефакторинг кода, обновление интерфейсов и улучшение производительности.'
                    },
                    {
                        title: 'Разработка приложений с поддержкой многопользовательского режима',
                        description: 'Создание серверных и десктопных приложений с возможностью одновременной работы нескольких пользователей, включая разработку сетевых протоколов, систем управления пользователями и обеспечения безопасности данных.'
                    }
                ]
            },
            {
                category: 'Интеграция сторонних сервисов',
                items: [
                    {
                        title: 'Интеграция с облачными сервисами и платформами',
                        description: 'Настройка и интеграция приложений с облачными сервисами, такими как AWS, Microsoft Azure, Google Cloud или сторонние облачные хранилища и базы данных. Включает подключение к API облачных платформ, настройку автоматических резервных копий, масштабирование и мониторинг.'
                    },
                    {
                        title: 'Интеграция с платёжными системами и шлюзами',
                        description: 'Реализация подключения приложений к платёжным системам и шлюзам, таким как PayPal, Sber или Square. Включает настройку обработки транзакций, управление платёжными данными, а также обеспечение безопасности и соответствие требованиям регулирования платежей.'
                    }
                ]
            }
        ]
    }
};

// Роуты
app.get('/', (req, res) => {
    res.render('index', {
        title: 'Главная',
        header_title: 'Услуги разработки, установки и наладки программного обеспечения, консультации',
        activities: acitvityes,
        current_path: req.path
    });
});

app.get('/about', (req, res) => {
    res.render('about', {
        title: 'О нас',
        header_title: 'Услуги разработки, установки и наладки программного обеспечения, консультации',
        about: about,
        current_path: req.path
    });
});

app.get('/services', (req, res) => {
    res.render('services', {
        title: 'Услуги',
        header_title: 'Услуги разработки, установки и наладки программного обеспечения, консультации',
        services: services,
        current_path: req.path
    });
});

app.post('/quest', (req, res) => {
    console.log(req.body);
    res.send('Заявка принята!');
});

app.listen(port, host, function () {
    console.log(`Server listens http://${host}:${port}`);
});
